First step is to import necessary libraries.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Then we can read all related data sources.

In [2]:
dailyactivity = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/dailyActivity_merged.csv')
dailycalories = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/dailyCalories_merged.csv')
dailyintensities = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/dailyIntensities_merged.csv')
dailysteps = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/dailySteps_merged.csv')
heartrate = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/heartrate_seconds_merged.csv')
hourlycalories = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/hourlyCalories_merged.csv')
hourlyintensities = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/hourlyIntensities_merged.csv')
hourlysteps = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/hourlySteps_merged.csv')
caloriesnarrow = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/minuteCaloriesNarrow_merged.csv')
calorieswide = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/minuteCaloriesWide_merged.csv')
intensitiesnarrow = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/minuteIntensitiesNarrow_merged.csv')
intensitieswide = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/minuteIntensitiesWide_merged.csv')
metsnarrow = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/minuteMETsNarrow_merged.csv')
minutesleep = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/minuteSleep_merged.csv')
minutestepsnarrow = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/minuteStepsNarrow_merged.csv')
minutestepswide = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/minuteStepsWide_merged.csv')
sleepday = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/sleepDay_merged.csv')
weightloginfo = pd.read_csv('/Users/jihyeson/Desktop/data science projects/Case Study 2/weightLogInfo_merged.csv')

I will read file one by one and then clean or formamt the data in cased needed.

### Daily Activity

Bring the first 5 rows to see if the data is in correct format.

In [3]:
dailyactivity.head(5)

,Id,ActivityDate,TotalSteps,TotalDistance,TrackerDistance,LoggedActivitiesDistance,VeryActiveDistance,ModeratelyActiveDistance,LightActiveDistance,SedentaryActiveDistance,VeryActiveMinutes,FairlyActiveMinutes,LightlyActiveMinutes,SedentaryMinutes,Calories
0,1503960366,4/12/2016,13162,8.50,8.50,0.0,1.88,0.55,6.06,0.0,25,13,328,728,1985
1,1503960366,4/13/2016,10735,6.97,6.97,0.0,1.57,0.69,4.71,0.0,21,19,217,776,1797
2,1503960366,4/14/2016,10460,6.74,6.74,0.0,2.44,0.40,3.91,0.0,30,11,181,1218,1776
3,1503960366,4/15/2016,9762,6.28,6.28,0.0,2.14,1.26,2.83,0.0,29,34,209,726,1745
4,1503960366,4/16/2016,12669,8.16,8.16,0.0,2.71,0.41,5.04,0.0,36,10,221,773,1863

Check rows, columns, data types

In [4]:
dailyactivity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 940 entries, 0 to 939
Data columns (total 15 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Id                        940 non-null    int64
 1   ActivityDate              940 non-null    object
 2   TotalSteps                940 non-null    int64
 3   TotalDistance             940 non-null    float64
 4   TrackerDistance           940 non-null    float64
 5   LoggedActivitiesDistance  940 non-null    float64
 6   VeryActiveDistance        940 non-null    float64
 7   ModeratelyActiveDistance  940 non-null    float64
 8   LightActiveDistance       940 non-null    float64
 9   SedentaryActiveDistance   940 non-null    float64
 10  VeryActiveMinutes         940 non-null    int64
 11  FairlyActiveMinutes       940 non-null    int64
 12  LightlyActiveMinutes      940 non-null    int64
 13  SedentaryMinutes          940 non-null    int64
 14  Calories                  940 non-null    int64
dtypes: float64(7), int64(7), object(1)
memory usage: 110.3+ KB

Since activity date is 'object' while it should be date/time format, I will change the data type.

In [5]:
dailyactivity['ActivityDate'] = pd.to_datetime(dailyactivity['ActivityDate'])

Now check again to see if data type for activity date has been correctly changed.

In [6]:
dailyactivity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 940 entries, 0 to 939
Data columns (total 15 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Id                        940 non-null    int64
 1   ActivityDate              940 non-null    datetime64[ns]
 2   TotalSteps                940 non-null    int64
 3   TotalDistance             940 non-null    float64
 4   TrackerDistance           940 non-null    float64
 5   LoggedActivitiesDistance  940 non-null    float64
 6   VeryActiveDistance        940 non-null    float64
 7   ModeratelyActiveDistance  940 non-null    float64
 8   LightActiveDistance       940 non-null    float64
 9   SedentaryActiveDistance   940 non-null    float64
 10  VeryActiveMinutes         940 non-null    int64
 11  FairlyActiveMinutes       940 non-null    int64
 12  LightlyActiveMinutes      940 non-null    int64
 13  SedentaryMinutes          940 non-null    int64
 14  Calories                  940 non-null    int64
dtypes: datetime64[ns](1), float64(7), int64(7)
memory usage: 110.3 KB

To check number of users in the report:

In [7]:
dailyactivity['Id'].nunique()

33

To get number of daily records for each user:

In [8]:
dailyactivity['Id'].value_counts()

1503960366    31
4319703577    31
8583815059    31
8378563200    31
8053475328    31
7086361926    31
6962181067    31
5553957443    31
4702921684    31
4558609924    31
1624580081    31
4388161847    31
4445114986    31
8877689391    31
1927972279    31
2873212765    31
2320127002    31
4020332650    31
2026352035    31
1844505072    31
2022484408    31
3977333714    30
1644430081    30
5577150313    30
8792009665    29
6290855005    29
6117666160    28
6775888955    26
7007744171    26
3372868164    20
8253242879    19
2347167796    18
4057192912     4
Name: Id, dtype: int64

Using describe function, I will check if there are any odds on the records.

In [9]:
dailyactivity.describe()

,Id,TotalSteps,TotalDistance,TrackerDistance,LoggedActivitiesDistance,VeryActiveDistance,ModeratelyActiveDistance,LightActiveDistance,SedentaryActiveDistance,VeryActiveMinutes,FairlyActiveMinutes,LightlyActiveMinutes,SedentaryMinutes,Calories
count,9.400000e+02,940.000000,940.000000,940.000000,940.000000,940.000000,940.000000,940.000000,940.000000,940.000000,940.000000,940.000000,940.000000,940.000000
mean,4.855407e+09,7637.910638,5.489702,5.475351,0.108171,1.502681,0.567543,3.340819,0.001606,21.164894,13.564894,192.812766,991.210638,2303.609574
std,2.424805e+09,5087.150742,3.924606,3.907276,0.619897,2.658941,0.883580,2.040655,0.007346,32.844803,19.987404,109.174700,301.267437,718.166862
min,1.503960e+09,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2.320127e+09,3789.750000,2.620000,2.620000,0.000000,0.000000,0.000000,1.945000,0.000000,0.000000,0.000000,127.000000,729.750000,1828.500000
50%,4.445115e+09,7405.500000,5.245000,5.245000,0.000000,0.210000,0.240000,3.365000,0.000000,4.000000,6.000000,199.000000,1057.500000,2134.000000
75%,6.962181e+09,10727.000000,7.712500,7.710000,0.000000,2.052500,0.800000,4.782500,0.000000,32.000000,19.000000,264.000000,1229.500000,2793.250000
max,8.877689e+09,36019.000000,28.030001,28.030001,4.942142,21.920000,6.480000,10.710000,0.110000,210.000000,143.000000,518.000000,1440.000000,4900.000000

There seems no outliers in the records. Now I will add 'Week day' column extracted from acvitiy date. (0: Monday, 6: Sunday)

In [10]:
dailyactivity['weekday'] = dailyactivity['ActivityDate'].dt.weekday
dailyactivity.head(3)

,Id,ActivityDate,TotalSteps,TotalDistance,TrackerDistance,LoggedActivitiesDistance,VeryActiveDistance,ModeratelyActiveDistance,LightActiveDistance,SedentaryActiveDistance,VeryActiveMinutes,FairlyActiveMinutes,LightlyActiveMinutes,SedentaryMinutes,Calories,weekday
0,1503960366,2016-04-12,13162,8.50,8.50,0.0,1.88,0.55,6.06,0.0,25,13,328,728,1985,1
1,1503960366,2016-04-13,10735,6.97,6.97,0.0,1.57,0.69,4.71,0.0,21,19,217,776,1797,2
2,1503960366,2016-04-14,10460,6.74,6.74,0.0,2.44,0.40,3.91,0.0,30,11,181,1218,1776,3

### Daily Carlories

Now I will check daily calories data table.

In [11]:
dailycalories.head(3)

           Id ActivityDay  Calories
0  1503960366   4/12/2016      1985
1  1503960366   4/13/2016      1797
2  1503960366   4/14/2016      1776

This data already exists in Daily Activity table. Therefore we can safely discard the table.

In [12]:
del dailycalories

### Daily Intensities

In [13]:
dailyintensities.head(3)

,Id,ActivityDay,SedentaryMinutes,LightlyActiveMinutes,FairlyActiveMinutes,VeryActiveMinutes,SedentaryActiveDistance,LightActiveDistance,ModeratelyActiveDistance,VeryActiveDistance
0,1503960366,4/12/2016,728,328,13,25,0.0,6.06,0.55,1.88
1,1503960366,4/13/2016,776,217,19,21,0.0,4.71,0.69,1.57
2,1503960366,4/14/2016,1218,181,11,30,0.0,3.91,0.40,2.44

This data is also exists in Daily Activity table. I will remove the table.

In [14]:
del dailyintensities

### Daily Steps

In [15]:
dailysteps.head(3)

           Id ActivityDay  StepTotal
0  1503960366   4/12/2016      13162
1  1503960366   4/13/2016      10735
2  1503960366   4/14/2016      10460

Again, this data is exists in Dailt Activity table. I will remove the table.

In [16]:
del dailysteps

### heart rate

In [17]:
heartrate.head(3)

           Id                  Time  Value
0  2022484408  4/12/2016 7:21:00 AM     97
1  2022484408  4/12/2016 7:21:05 AM    102
2  2022484408  4/12/2016 7:21:10 AM    105

In [18]:
heartrate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2483658 entries, 0 to 2483657
Data columns (total 3 columns):
 #   Column  Dtype
---  ------  -----
 0   Id      int64
 1   Time    object
 2   Value   int64
dtypes: int64(2), object(1)
memory usage: 56.8+ MB

Since 'Time' Column is 'object' where it should be timestamp, I will change the data type for this column.

In [19]:
heartrate['Time'] = pd.to_datetime(heartrate['Time'])

In [20]:
heartrate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2483658 entries, 0 to 2483657
Data columns (total 3 columns):
 #   Column  Dtype
---  ------  -----
 0   Id      int64
 1   Time    datetime64[ns]
 2   Value   int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 56.8 MB

In [21]:
heartrate[['Id','Time']].nunique()

Id          14
Time    961274
dtype: int64

### hourly calories

In [22]:
hourlycalories.head(3)

           Id           ActivityHour  Calories
0  1503960366  4/12/2016 12:00:00 AM        81
1  1503960366   4/12/2016 1:00:00 AM        61
2  1503960366   4/12/2016 2:00:00 AM        59

In [23]:
hourlycalories.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22099 entries, 0 to 22098
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            22099 non-null  int64
 1   ActivityHour  22099 non-null  object
 2   Calories      22099 non-null  int64
dtypes: int64(2), object(1)
memory usage: 518.1+ KB

This table also needs to conver data type for 'ActivityHour' from object to datetime.

In [24]:
hourlycalories['ActivityHour'] = pd.to_datetime(hourlycalories['ActivityHour'])

In [25]:
hourlycalories.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22099 entries, 0 to 22098
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            22099 non-null  int64
 1   ActivityHour  22099 non-null  datetime64[ns]
 2   Calories      22099 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 518.1 KB

In [26]:
hourlycalories.nunique()

Id               33
ActivityHour    736
Calories        442
dtype: int64

### hourly intensities

In [27]:
hourlyintensities.head(3)

           Id           ActivityHour  TotalIntensity  AverageIntensity
0  1503960366  4/12/2016 12:00:00 AM              20          0.333333
1  1503960366   4/12/2016 1:00:00 AM               8          0.133333
2  1503960366   4/12/2016 2:00:00 AM               7          0.116667

In [28]:
hourlyintensities.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22099 entries, 0 to 22098
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                22099 non-null  int64
 1   ActivityHour      22099 non-null  object
 2   TotalIntensity    22099 non-null  int64
 3   AverageIntensity  22099 non-null  float64
dtypes: float64(1), int64(2), object(1)
memory usage: 690.7+ KB

In [29]:
hourlyintensities['ActivityHour'] = pd.to_datetime(hourlyintensities['ActivityHour'])

In [30]:
hourlyintensities.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22099 entries, 0 to 22098
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                22099 non-null  int64
 1   ActivityHour      22099 non-null  datetime64[ns]
 2   TotalIntensity    22099 non-null  int64
 3   AverageIntensity  22099 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(2)
memory usage: 690.7 KB

### hourly steps

In [31]:
hourlysteps.head(3)

           Id           ActivityHour  StepTotal
0  1503960366  4/12/2016 12:00:00 AM        373
1  1503960366   4/12/2016 1:00:00 AM        160
2  1503960366   4/12/2016 2:00:00 AM        151

In [32]:
hourlysteps.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22099 entries, 0 to 22098
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            22099 non-null  int64
 1   ActivityHour  22099 non-null  object
 2   StepTotal     22099 non-null  int64
dtypes: int64(2), object(1)
memory usage: 518.1+ KB

In [33]:
hourlysteps['ActivityHour'] = pd.to_datetime(hourlysteps['ActivityHour'])

In [34]:
hourlysteps.head(3)

           Id        ActivityHour  StepTotal
0  1503960366 2016-04-12 00:00:00        373
1  1503960366 2016-04-12 01:00:00        160
2  1503960366 2016-04-12 02:00:00        151

### Combining hourly data tables

In [35]:
hourly_summary = pd.merge(left = pd.merge(left =hourlycalories, right = hourlyintensities, how = 'outer',
                                   on =['Id','ActivityHour']), right = hourlysteps, how='outer', 
                          on = ['Id','ActivityHour'])
hourly_summary.head(3)

,Id,ActivityHour,Calories,TotalIntensity,AverageIntensity,StepTotal
0,1503960366,2016-04-12 00:00:00,81,20,0.333333,373
1,1503960366,2016-04-12 01:00:00,61,8,0.133333,160
2,1503960366,2016-04-12 02:00:00,59,7,0.116667,151

### calories narrow/wide

In [36]:
caloriesnarrow.head(3)

           Id         ActivityMinute  Calories
0  1503960366  4/12/2016 12:00:00 AM    0.7865
1  1503960366  4/12/2016 12:01:00 AM    0.7865
2  1503960366  4/12/2016 12:02:00 AM    0.7865

In [37]:
caloriesnarrow.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1325580 entries, 0 to 1325579
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   Id              1325580 non-null  int64
 1   ActivityMinute  1325580 non-null  object
 2   Calories        1325580 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 30.3+ MB

In [38]:
caloriesnarrow.shape

(1325580, 3)

- calories: total number of estimated calories burned in each minute.

In [39]:
calorieswide.head(3)

,Id,ActivityHour,Calories00,Calories01,Calories02,Calories03,Calories04,Calories05,Calories06,Calories07,...,Calories50,Calories51,Calories52,Calories53,Calories54,Calories55,Calories56,Calories57,Calories58,Calories59
0,1503960366,4/13/2016 12:00:00 AM,1.8876,2.2022,0.9438,0.9438,0.9438,2.0449,0.9438,2.2022,...,0.9438,2.0449,2.0449,0.9438,2.3595,1.8876,0.9438,0.9438,0.9438,0.9438
1,1503960366,4/13/2016 1:00:00 AM,0.7865,0.7865,0.7865,0.7865,0.9438,0.9438,0.9438,0.7865,...,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865
2,1503960366,4/13/2016 2:00:00 AM,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865,...,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865,0.7865

In [40]:
calorieswide.shape

(21645, 62)

- calories 00~calories 52:Total number of estimated calories burned. Example: Calories05 = calories burned in fifth minute of the hour.

In [41]:
caloriesnarrow['ActivityMinute'] = pd.to_datetime(caloriesnarrow['ActivityMinute'])
calorieswide['ActivityHour'] = pd.to_datetime(calorieswide['ActivityHour'])

### intensities narrow/wide

In [42]:
intensitiesnarrow.head(3)

           Id         ActivityMinute  Intensity
0  1503960366  4/12/2016 12:00:00 AM          0
1  1503960366  4/12/2016 12:01:00 AM          0
2  1503960366  4/12/2016 12:02:00 AM          0

In [43]:
intensitiesnarrow.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1325580 entries, 0 to 1325579
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   Id              1325580 non-null  int64
 1   ActivityMinute  1325580 non-null  object
 2   Intensity       1325580 non-null  int64
dtypes: int64(2), object(1)
memory usage: 30.3+ MB

In [44]:
intensitiesnarrow['ActivityMinute'] = pd.to_datetime(intensitiesnarrow['ActivityMinute'])

In [45]:
intensitiesnarrow['Intensity'].unique()

array([0, 1, 2, 3])

Intensity values
- 0 = Sedentary 
- 1 = Light 
- 2 =  Moderate 
- 3 = Very Active

In [46]:
intensitiesnarrow['intensitiy_status'] = intensitiesnarrow['Intensity'].replace({0:'Sedentary',1:'Light',2:'Moderate',3:'Very Active'})

In [47]:
intensitiesnarrow.head(3)

           Id      ActivityMinute  Intensity intensitiy_status
0  1503960366 2016-04-12 00:00:00          0         Sedentary
1  1503960366 2016-04-12 00:01:00          0         Sedentary
2  1503960366 2016-04-12 00:02:00          0         Sedentary

In [48]:
intensitieswide.head(3)

,Id,ActivityHour,Intensity00,Intensity01,Intensity02,Intensity03,Intensity04,Intensity05,Intensity06,Intensity07,...,Intensity50,Intensity51,Intensity52,Intensity53,Intensity54,Intensity55,Intensity56,Intensity57,Intensity58,Intensity59
0,1503960366,4/13/2016 12:00:00 AM,1,1,0,0,0,1,0,1,...,0,1,1,0,1,1,0,0,0,0
1,1503960366,4/13/2016 1:00:00 AM,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1503960366,4/13/2016 2:00:00 AM,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0